import React from "react";

const loremTxt =
  "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.";

const PrivacySection = () => {
  return (
    <>
      <section className="container mx-auto ">
        <div className="flex flex-col">
          <h1 className="text-3xl text-center mb-8 ">سیاست حفظ حریم خصوصی</h1>

          <div className="w-full px-4 flex flex-col gap-y-8">
            <div className="flex flex-col gap-y-4">
              <h6 className="text-2xl md:text-3xl">
                {" "}
                چه اطلاعاتی از شما دریافت می شود ؟
              </h6>
              <p className="text-neutral-500 pr-0 md:pr-4 text-justify md:text-right text-sm md:text-base">
                برای ثبت نام در اپلیکیشن و وبسایت سوین لازم است اطلاعاتی مانند
                نام و نام خانوادگی و تلفن همراه خود را در اختیار ما قرار دهید
                دریافت مشخصات فردی شما نیز صرفا برای ثبت نام در سایت و هماهنگی
                های لازم و ارسال اعلان های مهم و با خبر کردن شما از اکانت خود
                است
              </p>
            </div>
            <div className="flex flex-col gap-y-4">
              <h6 className="text-2xl md:text-3xl">
                {" "}
                چگونه از اطلاعات شما محافظت می شود ؟
              </h6>
              <p className="text-neutral-500 pr-0 md:pr-4 text-justify md:text-right text-sm md:text-base">
                در طراحی و ساخت اپلیکیشن و وبسایت سوین سعی شده که از بالاترین
                سطوح امنیتی و سخت افزاری و نرم افزاری استفاده شود در زمان ثبت
                نام ، درخواست کد تایید تلفن ، هنگام چت ، بلاک کردن ، لایک کردن و
                غیره تمامی فعالیت و خدمات بر روی سرور های ایمن ما ذخیره و توسط
                فایروال های مستحکم محافظت خواهد شد اطلاعات شخصی شما همچنین به
                صورت رمز نگاری شده در بستر امن https در وبسایت سوین نگهداری
                خواهد شد
              </p>
            </div>
            <div className="flex flex-col gap-y-4">
              <h6 className="text-2xl md:text-3xl">
                چه استفاده ای از اطلاعات شما خواهد شد ؟
              </h6>
              <p className="text-neutral-500 pr-0 md:pr-4 text-justify md:text-right text-sm md:text-base">
                اطلاعات شما مانند نام ، نام خانوادگی ، سن ، عکس پروفایل ، به غیر
                از شماره تلفن شما نیز صرفا جهت نمایش در حساب کاربری شما می باشد
                همچنین می توانید بدون عکس پروفایل فعالیت کنید
              </p>
            </div>

            <div className="flex flex-col gap-y-4">
              <h6 className="text-2xl md:text-3xl">
                چه کسانی به اطلاعات شما دسترسی دارند ؟{" "}
              </h6>
              <p className="text-neutral-500 pr-0 md:pr-4 text-justify md:text-right text-sm md:text-base">
                ادمین و پلیس سایت به اطلاعات شما دسترسی دارند آن هم برای
                پشتیبانی و امنیت و ارائه خدمات بهتر اطلاعات شخصی شما مانند شماره
                تلفن نزد ما محفوظ خواهد ماند و در اختیار افراد قرار نخواهد گرفت
                بدیهی است که مراجع قانونی با ارائه حکم دادگاه قادرند به این
                اطلاعات دسترسی داشته باشند
              </p>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default PrivacySection;
